#pragma once
#include <string>
#include <map>
#include <vector>
#include <algorithm>

static const std::map<wchar_t, wchar_t> lowercase =
{
    {L'А',L'а'},
    {L'Б',L'б'},
    {L'В',L'в'},
    {L'Г',L'г'},
    {L'Ґ',L'г'},
    {L'Д',L'д'},
    {L'Е',L'е'},
    {L'Ж',L'ж'},
    {L'З',L'з'},
    {L'И',L'и'},
    {L'І',L'і'},
    {L'Ї',L'ї'},
    {L'Й',L'й'},
    {L'К',L'к'},
    {L'Л',L'л'},
    {L'М',L'м'},
    {L'Н',L'н'},
    {L'О',L'о'},
    {L'П',L'п'},
    {L'Р',L'р'},
    {L'С',L'с'},
    {L'Т',L'т'},
    {L'У',L'у'},
    {L'Ф',L'ф'},
    {L'Х',L'х'},
    {L'Ц',L'ц'},
    {L'Ч',L'ч'},
    {L'Ш',L'ш'},
    {L'Щ',L'щ'},
    {L'Ь',L'ь'},
    {L'Ю',L'ю'},
    {L'Я',L'я'},
    {L'а',L'а'},
    {L'б',L'б'},
    {L'в',L'в'},
    {L'г',L'г'},
    {L'ґ',L'г'},
    {L'д',L'д'},
    {L'е',L'е'},
    {L'ж',L'ж'},
    {L'з',L'з'},
    {L'и',L'и'},
    {L'і',L'і'},
    {L'ї',L'ї'},
    {L'й',L'й'},
    {L'к',L'к'},
    {L'л',L'л'},
    {L'м',L'м'},
    {L'н',L'н'},
    {L'о',L'о'},
    {L'п',L'п'},
    {L'р',L'р'},
    {L'с',L'с'},
    {L'т',L'т'},
    {L'у',L'у'},
    {L'ф',L'ф'},
    {L'х',L'х'},
    {L'ц',L'ц'},
    {L'ч',L'ч'},
    {L'ш',L'ш'},
    {L'щ',L'щ'},
    {L'ь',L'ь'},
    {L'ю',L'ю'},
    {L'я',L'я'}
};

static const std::vector<wchar_t> alphabet =
{ L'а',L'б',L'в',L'г',L'д',L'е',L'ж',L'з',L'и',L'і',L'ї',L'й',L'к',L'л',L'м',L'н',L'о',L'п',L'р',L'с',L'т',L'у',L'ф',L'х',L'ц',L'ч',L'ш',L'щ',L'ь',L'ю', L'я' };


static const std::vector<std::wstring> theMostBigrams = { L"на",L"ов",L"ав",L"не",L"ли",L"го",L"та",L"ти",L"ві",L"ал",L"по",L"ро",L"ог",L"ва",L"ст",L"ло",L"ка"};
static const std::vector<std::wstring> theRareBigrams = { L"ае",L"аи",L"аь",L"бб",L"бг",L"бж",L"бї",L"бй",L"бм",L"бп",L"бф",L"бх",L"бц",L"бч",L"бш",L"бщ",L"бь",L"бю",L"бя",L"вф",L"вь",L"вю",L"гб",L"гв",L"гг",L"гд",L"гж",L"гї",L"гй",L"гм",L"гп",L"гс",L"гф",L"гх",L"гц",L"гч",L"гш",L"гщ",L"гь",L"гю",L"гя",L"дї",L"дй",L"дф",L"дщ",L"дю",L"ее",L"еи",L"еф",L"еь",L"жг",L"жж",L"жї",L"жй",L"жл",L"жр",L"жф",L"жх",L"жц",L"жш",L"жщ",L"жь",L"жю",L"жя",L"зї",L"зй",L"зф",L"зш",L"зщ",L"зю",L"ие",L"ии",L"иф",L"иь",L"ию",L"іе",L"іи",L"іф",L"іь",L"їа",L"їе",L"їж",L"їи",L"їо",L"їу",L"їф",L"їц",L"їч",L"їш",L"їщ",L"їь",L"їю",L"їя",L"йе",L"йи",L"йї",L"йй",L"йф",L"йь",L"йю",L"кї",L"кй",L"кф",L"кх",L"кц",L"кч",L"кш",L"кь",L"кю",L"лб",L"лв",L"лг",L"лж",L"лз",L"лї",L"лй",L"лм",L"лн",L"лп",L"лр",L"лс",L"лт",L"лф",L"лх",L"лц",L"лч",L"лш",L"лщ",L"мж",L"мї",L"мй",L"мф",L"мц",L"мш",L"мь",L"мю",L"нж",L"нї",L"нй",L"нл",L"нр",L"нф",L"нх",L"нщ",L"ое",L"ои",L"оь",L"пб",L"пв",L"пг",L"пд",L"пж",L"пз",L"пї",L"пй",L"пм",L"пп",L"пс",L"пф",L"пх",L"пч",L"пш",L"пщ",L"пь",L"пю",L"рї",L"рй",L"рр",L"рф",L"рщ",L"рь",L"сб",L"сг",L"сд",L"сж",L"сї",L"сй",L"ср",L"сф",L"сч",L"сш",L"сщ",L"тг",L"тд",L"тж",L"тї",L"тй",L"тм",L"тф",L"тц",L"тч",L"тш",L"тщ",L"уе",L"уи",L"уї",L"уь",L"фб",L"фв",L"фг",L"фд",L"фе" };

static const std::vector<std::wstring> theMostLetters = {L"о",L"а",L"и",L"н",L"в",L"і",L"е",L"т",L"с",L"л"};
static const std::vector<std::wstring> theRareLetters = { L"ф",L"ї",L"ц",L"щ",L"ю"};

size_t charNumbInAlph(wchar_t ch);
